# 标识符： 变量，模块名，函数名，类名
# 标识符的命名规则
# 规则：1. 由数字字母和_下划线组成，不能以数字开头
# 规则：2 严格区分大小写（计算机编程里面，一共有52个字母，a-z A-Z）
# 规则：3 不能使用关键字，关键字就是在python里面有特殊含义的单词 列如： if else for
# 规则：4 变量的命名要规范，顾名思义 遵守规范会显得专业，并且代码已读
# 1. 顾名思义
# 2. 遵守一定的命名规范
#  1. 小驼峰命名法: 第一个单词的首字母小写,以后每个单词的首字母都大写 userNameAndPassword
#  2. 大驼峰命名法: 每个单词的首字母都是大写 PersonModel
#  3. 使用下划线连接: user_name_password
#  4. 在python里的变量，函数，模块名，使用下划线连接，python里面的类名使用大驼峰命名法
a = 23
_a = 'hello'
print(_a)
# 3m = 'hello' #会报错
# print(3m)

# T = 'ok'
# print(t) #小写的t 找不到

# if = 'ok' # 关键字不能使用
# print(true)


